2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpDoelbinding/data/VR00093-Mutatiebericht-TC02-2-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670041</ABONNEMENT>
            <NAAM>Abo GeefDetailsPersoon</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>036101</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>c189a09e-e7c0-49ac-95f6-dca8f3a88424</brp:referentienummer>
    <brp:tijdstipVerzending>2014-11-19T14:24:31.689+01:00</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Abo GeefDetailsPersoon</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:meldingen>
    <brp:melding brp:objecttype="Melding" brp:referentieID="1">
      <brp:regelCode>BRLV0032</brp:regelCode>
      <brp:soortNaam>Waarschuwing</brp:soortNaam>
      <brp:melding>Waarschuwing: verstrekkingsbeperking aanwezig.</brp:melding>
    </brp:melding>
  </brp:meldingen>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>07001</brp:code>
    <brp:naam>Verkrijging reisdocument</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>017401</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="1">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>2014-05-05T02:00:00.000+02:00</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>*</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>2014-05-05T02:00:00.000+02:00</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>2000-01-01T01:00:00.000+01:00</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>2000-01-01</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>340014155</brp:burgerservicenummer>
          <brp:administratienummer>3403168595</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>2000-01-01T01:00:00.000+01:00</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1970-08-08</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Jo</brp:voornamen>
          <brp:geslachtsnaamstam>Elk</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>2000-01-01T01:00:00.000+01:00</brp:tijdstipRegistratie>
          <brp:datum>1970-08-08</brp:datum>
          <brp:gemeenteCode>0990</brp:gemeenteCode>
          <brp:woonplaatsnaam>Zevenaar</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>2000-01-01T01:00:00.000+01:00</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1970-08-08</brp:datumAanvangGeldigheid>
          <brp:code>M</brp:code>
        </brp:geslachtsaanduiding>
        <brp:reisdocumenten>
          <brp:reisdocument brp:objectSleutel="*" brp:objecttype="PersoonReisdocument" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:soortCode>PN</brp:soortCode>
            <brp:nummer>123456789</brp:nummer>
            <brp:autoriteitVanAfgifte>1704</brp:autoriteitVanAfgifte>
            <brp:datumIngangDocument>${vandaag(0,0,-1)}</brp:datumIngangDocument>
            <brp:datumEindeDocument>${vandaag(5,0,0)}</brp:datumEindeDocument>
            <brp:datumUitgifte>${vandaag()}</brp:datumUitgifte>
          </brp:reisdocument>
        </brp:reisdocumenten>
        <brp:administratieveHandelingen>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>07001</brp:code>
            <brp:naam>Verkrijging reisdocument</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>017401</brp:partijCode>
            <brp:toelichtingOntlening>toelichting</brp:toelichtingOntlening>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:communicatieID="*">
                <brp:document brp:objecttype="Document" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:soortNaam>Nederlandse rechterlijke uitspraak</brp:soortNaam>
                  <brp:identificatie>identificatieTC0101</brp:identificatie>
                  <brp:aktenummer>8901234</brp:aktenummer>
                  <brp:partijCode>017401</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="*">
                <brp:soortNaam>Registratie reisdocument</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
        </brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>